[
  {
    "id": 1,
    "title": "Hero Section",
    "before": {
      "title": "Before",
      "content": [
        {
          "id": 1,
          "imgSrc": "landing-page-old.png",
          "alt": "Zeeguu desktop landing page hero section before redesign. At the top, an orange bar contains the Zeeguu logo on the left and language toggle buttons for Danish and English on the right, shown with circular flags. Centered below is a large orange elephant logo, followed by the project name 'Zeeguu' in bold orange text. A description states: A research project aiming to personalize reading and vocabulary practice in foreign languages.' Below are two centered buttons: an orange 'Log in' button and an outlined 'Become a Betatester!' button.",
          "description": "The value proposition of the platform was ambiguous. A visually prominent login button next to a less noticeable registration button with unclear wording, led newcomers to mistakenly click login first."
        }
      ]
    },
    "after": {
      "title": "After",
      "content": [
        {
          "id": 1,
          "imgSrc": "landing-page-new.png",
          "alt": "Zeeguu desktop landing page hero section after redesign. Main heading says: 'Learn a language by reading what you love and improve your vocabulary.' Subheading explains: 'Find interesting articles, translate words as you read, and use spaced repetition to remember them' Below, a button labeled 'Start Learning.' Language selection options include Danish, Dutch, French, Italian, Swedish, Romanian, and Spanish. Top of the page includes the Zeeguu logo and two navigation links: 'Log In' and 'Register.'",
          "description": "A clear value proposition highlights all the benefits users gain from using the platform. The registration button is more visually prominent, with concise and clear wording. The list of available languages provides a transparent overview of the learning options."
        }
      ]
    }
  },
  {
    "id": 2,
    "title": "Registration",
    "before": {
      "title": "Before",
      "content": [
        {
          "id": 1,
          "imgSrc": "register-old.png",
          "alt": "Zeeguu desktop registration screen with an orange background. A centered white card displays a white elephant logo, a 'Create Account' heading, input fields for Invite Code, Name, Email, and Password, followed by dropdowns for Learned Language, Level in Learned Language, and Base Language (English Recommended). Below is a 17-line privacy notice and a 'Create Account' button at the bottom.",
          "description": "Unclear labeling on input fields and dropdowns caused confusion, and inconsistent styling affected the overall experience. The abundance of options and content could feel overwhelming, and the 'Create account' button was difficult to find - particularly on small laptop screens and mobile devices."
        }
      ]
    },

    "after": {
      "title": "After",
      "content": [
        {
          "id": 1,
          "imgSrc": "register-step1-new.png",
          "alt": "Zeeguu desktop registration screen - step 1. Language selection form with three dropdown inputs: one for selecting the language to learn, another for current proficiency level, and a third for preferred translation language. The form is displayed on a white card against an orange background. At the top, there's a notice about needing an invite code to continue registration, with the zeeguu.team@gmail.com contact email provided. A prominent 'Next' button appears at the bottom, along with a 'Log In' link for existing users.",
          "description": "User Registration - Step 1: Language selection allows users to select their practiced languages. The dropdown labels have clearer, more user‑friendly descriptions."
        },
        {
          "id": 2,
          "imgSrc": "register-step2-new.png",
          "alt": "Zeeguu desktop registration screen - step 2. Beta account creation form on a white card against an orange background. The form includes fields for: invite code with a note to request one at zeeguu.team@gmail.com, full name input, email address input, and password fields with a minimum 4-character requirement. At the bottom is a checkbox to agree to the Privacy Notice, followed by a prominent 'Create Account' button in orange. Below the form is a 'Log In' link for existing users.",
          "description": "User Registration - Step 2: This step focuses on the account creation process. Input fields have a consistent visual style matching the dropdowns from step one, and include clearer instructions - such as the required password length."
        }
      ]
    }
  },
  {
    "id": 3,
    "title": "User Onboarding Flow",
    "before": {
      "title": "Before",
      "content": [
        {
          "id": 1,
          "imgSrc": "install-extension-old.png",
          "alt": "Zeeguu browser extension installation page on a white card with a cream background. The page is titled 'Welcome to Zeeguu' with a subtitle 'Time to install the Zeeguu Reader browser extension'. The content explains that users can access words, article recommendations, and exercises on zeeguu.org, but only for articles shared by teachers or saved via the extension. Three key features are listed: one-click translation and pronunciation, removal of excess clutter from articles, and generation of personalized vocabulary exercises. Two prominent buttons are displayed: 'Install for Chrome or Edge' and 'Install for Firefox'. At the bottom, there's a link stating 'Don't want the extension? Go to articles.",
          "description": "User Onboarding - Step 1: Users were introduced to the platform's main features and prompted to install the browser extension, which enables key functionalities like translations and pronunciation. However, this step also appeared on mobile and unsupported browsers, which caused confusion. Additionally, the large amount of information contributed to cognitive overload."
        },
        {
          "id": 2,
          "imgSrc": "extension-installed-old.png",
          "alt": "Zeeguu extension installation confirmation page with a white background. The page displays 'Extension is installed!' at the top, followed by a heading 'Pin it to the toolbar to make it easy to access'. Below is a link to 'Learn how it works by watching this video'. The main content shows a screenshot of Wikipedia's Chrome Web Store page with the Zeeguu extension icon visible in the browser's toolbar. At the bottom is an orange button labeled 'Go to article recommendations' which spans the full width of the content area.",
          "description": "User Onboarding - Step 2: Confirmed the successful installation of the Zeeguu browser extension. An animation demonstrated how to activate the extension, but its busy visuals distracted from the core message."
        },
        {
          "id": 3,
          "imgSrc": "empty-homepage-old.png",
          "alt": "Zeeguu empty homepage showing navigation and search interface. Top navigation displays 'Recommended | Saved' tabs, with 'Recommended' being active. Below are 'Interests' and 'Non-interests' filter buttons, followed by a search bar labeled 'Search all articles' with a magnifying glass icon. A 'Sort by:' dropdown offers 'Length' and 'Level' options. The main content area shows a message: 'We can not find articles in the language you want to study and for your current interests. Consider changing your interests. Alternatively read articles with the help of the Zeeguu browser extension. You can also add articles to My Texts through the Save article to Zeeguu.org button from within the extension.' The left sidebar contains navigation links for Home, Words, Exercises, History, Statistics, Teacher Site, Settings, and Logout, with an orange elephant logo at the top.",
          "description": "The home screen appeared empty due to the lack of initial customization, which could give users the misleading impression that something was broken."
        }
      ]
    },

    "after": {
      "title": "After",
      "content": [
        {
          "id": 1,
          "imgSrc": "select-interests.png",
          "alt": "Zeeguu interests selection page showing a white card on an orange background. At the top is an orange elephant logo followed by the heading 'What would you like to read about?' Below are seven topic buttons arranged in three rows: 'Business' and 'Culture & Art' in the first row, 'Politics', 'Sports', and 'Technology & Science' in the second row, and 'Travel & Tourism' in the third row. Some topics are outlined in grey while others have an orange fill, indicating selected state. At the bottom is reassuring text 'You can always change it later' followed by a prominent orange 'Next' button with an arrow icon.",
          "description": "User Onboarding - Step 1: Hobby selection allows users to personalize the content they will see after creating an account"
        },
        {
          "id": 2,
          "imgSrc": "exclude-words.png",
          "alt": "Zeeguu word exclusion setup page showing a white card on an orange background. At the top is an orange elephant logo, followed by the heading 'Would you like to exclude articles and exercises containing particular words or phrases?' Below is a text input field with placeholder text 'E.g. robbery' and a plus button to its right. Helper text underneath reads 'Add one unwanted word or phrase at a time'. At the bottom of the card is reassuring text 'You can always change it later' and a prominent 'Next' button with an arrow icon.",
          "description": "User Onboarding - Step 2: Keyword exclusion lets users hide content they may find triggering, helping create a safer and more personalized experience from the first use."
        },
        {
          "id": 3,
          "imgSrc": "install-extension-new.png",
          "alt": "Zeeguu browser extension installation page showing a white card on an orange background. At the top is an orange elephant logo above the heading 'Read and translate foreign articles with the Zeeguu browser extension'. The center features an illustration demonstrating the extension's functionality, showing highlighted words 'artists', 'a museum', and 'or' with toggle switches for 'See translation' and 'Hear pronunciation'. Below, there's text explaining browser compatibility: 'The Chrome Web Store extension also works in Edge, Opera, Arc, Vivaldi, Brave and other Chromium based browsers.' At the bottom is a prominent 'Install from Chrome Web Store' button with an arrow icon, followed by an 'I will install it later' link.",
          "description": "User Onboarding - Step 3 (desktop only): Users are introduced to and prompted to install the browser extension, which is essential for accessing key platform features such as translations and pronunciation. A button redirects them to the correct extension store based on their browser."
        },
        {
          "id": 4,
          "imgSrc": "extension-installed-new.png",
          "alt": "Zeeguu extension installation success page showing a white card on an orange background. At the top is an orange elephant logo followed by the heading 'Right-click anywhere on any article's page to access the Zeeguu extension'. The center features an illustration demonstrating the right-click functionality, showing a webpage with a popup menu and cursor. Below the illustration, there's a prominent orange button labeled 'Go to Zeeguu' at the bottom of the card.",
          "description": "User Onboarding - Step 4 (desktop only): Confirms the successful installation of the Zeeguu browser extension. Introduces users to activating the extension via right‑click functionality."
        }
      ]
    }
  },
  {
    "id": 4,
    "title": "Settings",
    "before": {
      "title": "Before",
      "content": [
        {
          "id": 1,
          "imgSrc": "settings-old.png",
          "alt": "Zeeguu settings page with an orange sidebar. The main content area shows a settings form with the following fields: Name (input field), Email (input field), Learned Language (dropdown showing Danish), Level in Learned Language (dropdown), Native Language (dropdown showing Polish), and System Language (dropdown showing English). Below these fields is an orange 'Save' button. At the bottom is a section showing 'Your current class is: Zeeguu Betatesters' with a 'Change Class' option that includes an input field for a new invite code and an orange 'Change Class' button.",
          "description": "Settings options were not grouped by theme, making navigation difficult. UI components appeared visually inconsistent and behaved unpredictably. The overall layout lacked scalability, making it challenging to add new options in the future."
        }
      ]
    },
    "after": {
      "title": "After",
      "content": [
        {
          "id": 1,
          "imgSrc": "settings-new.png",
          "alt": "Redesigned Zeeguu settings page with an orange sidebar containing navigation links. The main content area is organized into four sections: 'My Account' with 'Profile Details' and 'Language Settings' options, 'Reading Preferences' containing 'Interests' and 'Excluded Keywords' options, 'Exercises' with 'Exercise Type Preferences', and 'Account Management' with a 'Delete Account' option. Each option is presented as a clickable card with a right arrow icon, indicating they lead to detailed settings pages. The layout is clean and hierarchical, with clear section headings in gray text.",
          "description": "Settings options are now grouped by theme, with each option placed on a separate screen. This reduces visual clutter and creates space for adding more options in the future."
        }
      ]
    }
  }
]
